app/Http/Controllers/AlbumsController.php

    public function index()
    {
        $albums = Album::orderBy('updated_at', 'desc')->paginate(5);
        return view('albums.index')->with('albums', $albums);
---
select * from `albums` order by `updated_at` desc limit 5 offset 0
select count(*) as aggregate from `albums`

    public function create()
    {
        $theimages = Imagepage::orderBy('updated_at', 'desc')->paginate(20);
---
select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`

    public function store(Request $request)
    {
        $this->validate($request, [
            'titleFr' => 'required',
            'titleEn' => 'required',
            'titleIFr',
            'titleIEn',
            'legendIFr',
            'legendIEn',
            'nameImage',
        ]);

        $album = new Album;
        $album->titleFr = $request->input('titleFr');
        $album->titleEn = $request->input('titleEn');

        $theimages = Imagepage::orderBy('updated_at', 'desc')->paginate(20);
---
select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`

        if (($request->input('action')) == 'save' && is_null($album->id))  {
            $album->save();
            $theimage->save();
            $album->imagepages()->sync($theimage->id, false);
            return redirect()->action('AlbumsController@edit', $album)->with('success', 'Image créée!');
---
insert into `imagepages` (`titleIFr`, `titleIEn`, `legendIFr`, `legendIEn`, `nameImage`, `updated_at`, `created_at`) values ('bon1', 'bon1', 'bon1', 'bon1', '1543999850.jpg', '2018-12-06 08:40:52', '2018-12-06 08:40:52')
insert into `albums` (`titleFr`, `titleEn`, `updated_at`, `created_at`) values ('merdouille', 'merdouille', '2018-12-06 09:24:23', '2018-12-06 09:24:23')
select * from `imagepages`

    public function edit($id)
    {
        $album = Album::find($id);
        $theimages = Imagepage::all();

        return view('albums.edit')->with('album', $album)->with('theimages', $theimages);
---
select * from `imagepages`
select `imagepages`.*, `album_imagepage`.`album_id` as `pivot_album_id`, `album_imagepage`.`imagepage_id` as `pivot_imagepage_id` from `imagepages` inner join `album_imagepage` on `imagepages`.`id` = `album_imagepage`.`imagepage_id` where `album_imagepage`.`album_id` = 8

    public function update(Request $request, $id)
    {
        $album = Album::find($id);

        if (($request->input('action')) == 'save')  {
            $theimage = new Imagepage;
            $theimage->titleIFr = $request->input('titleIFr');
            $theimage->titleIEn = $request->input('titleIEn');
            $theimage->legendIFr = $request->input('legendIFr');
            $theimage->legendIEn = $request->input('legendIEn');
            $theimage->nameImage = $request->input('nameImage');
            $album = Album::find($album->id);
            $theimage->save();
            $album->imagepages()->sync($theimage->id, false);
---
insert into `imagepages` (`titleIFr`, `titleIEn`, `legendIFr`, `legendIEn`, `nameImage`, `updated_at`, `created_at`) values ('lefran1null', 'lefran1', 'lefran1', 'lefran1', '1543968544.jpg', '2018-12-05 23:31:42', '2018-12-05 23:31:42')
insert into `album_imagepage` (`album_id`, `imagepage_id`) values (104, 76)
insert into `imagepages` (`titleIFr`, `titleIEn`, `legendIFr`, `legendIEn`, `nameImage`, `updated_at`, `created_at`) values ('foir1null', 'foir1', 'foir1', 'foir1', '1543999850.jpg', '2018-12-06 01:15:11', '2018-12-06 01:15:11')