app/Http/Controllers/AlbumsController.php

insert into `albums` (`titleFr`, `titleEn`, `updated_at`, `created_at`) values ('po', 'po', '2018-12-06 12:53:04', '2018-12-06 12:53:04')
insert into `imagepages` (`titleIFr`, `titleIEn`, `legendIFr`, `legendIEn`, `nameImage`, `updated_at`, `created_at`) values ('po1null', 'po1', 'po1', 'po1', '1543999850.jpg', '2018-12-06 12:53:04', '2018-12-06 12:53:04')
insert into `album_imagepage` (`album_id`, `imagepage_id`) values (178, 156)
---
        }

        if (($request->input('action')) == 'save' && is_null($album->id))  {
            $album->save();
            $theimage->save();
            $album->imagepages()->sync($theimage->id, false);

select * from `imagepages`
---
    public function edit($id)
    {
        $album = Album::find($id);
        $theimages = Imagepage::all();

        return view('albums.edit')->with('album', $album)->with('theimages', $theimages);

insert into `imagepages` (`titleIFr`, `titleIEn`, `legendIFr`, `legendIEn`, `nameImage`, `updated_at`, `created_at`) values ('ho2null', 'ho2', 'ho2', 'ho2', '1543999850.jpg', '2018-12-06 12:51:52', '2018-12-06 12:51:52')
insert into `album_imagepage` (`album_id`, `imagepage_id`) values (177, 155)
---
    public function update(Request $request, $id)
    {
        $album = Album::find($id);

        if (($request->input('action')) == 'save')  {
            $theimage = new Imagepage;
            $theimage->titleIFr = $request->input('titleIFr');
            $theimage->titleIEn = $request->input('titleIEn');
            $theimage->legendIFr = $request->input('legendIFr');
            $theimage->legendIEn = $request->input('legendIEn');
            $theimage->cover = $request->input('cover');
            $theimage->nameImage = $request->input('nameImage');

            if ($request->hasFile('nameImage')) {
                $myImage = $request->file('nameImage');
                $filename = time() . '.' . $myImage->getClientOriginalExtension();
                $location = public_path('myimages/' . $filename);
                Image::make($myImage)->resize(800,400)->save($location);
                $theimage->nameImage = $filename;
            }

            $album = Album::find($album->id);
            $theimage->save();
            $album->imagepages()->sync($theimage->id, false);