app/Http/Controllers/EventsController.php

    public function index()
    {
        $events = Event::orderBy('created_at', 'desc')->paginate(5);
        return view('events.index')->with('events', $events);
---
select count(*) as aggregate from `events`
select * from `events` order by `created_at` desc limit 20 offset 0

    public function create()
    {
        $theimages = Imagepage::orderBy('updated_at', 'desc')->paginate(20);
---
select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`

    public function show($id)
    {
        $event = Event::find($id);
        $theimages = Imagepage::all();
        $theimage = $event->imagepage;
        return view('events.show')->with('event', $event)->with('theimage',$theimage)->with('theimages',$theimages);
---
select * from `imagepages`
select * from `imagepages` where `imagepages`.`id` = 20 limit 1