app/Http/Controllers/InfosController.php

    public function index()
    {
        $infos = Info::orderBy('updated_at','desc')->paginate(5);
        return view('infos.index')->with('infos', $infos);
---
select * from `infos` order by `updated_at` desc limit 5 offset 0