app/Http/Controllers/InfosController.php

select * from `paragraphs`
---
            $paragraph->info()->associate($info);
            $paragraph->save();
            $theparagraphs = $info->paragraphs;
            return redirect()->action('InfosController@edit', $info)->with('success', 'Paragraphe créé!');