app/Http/Controllers/InfosController.php

select * from `infos` where `parent_id` = 0
select * from `infos` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `infos`
---
    public function index()
    {
        $theinfos = Info::where('parent_id', '=', 0)->get();
        $allinfos = Info::pluck('titleInFr','id')->all();
        $infos = Info::orderBy('updated_at','desc')->paginate(20);

select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`
---
    public function create()
    {
        $theimages = Imagepage::orderBy('updated_at', 'desc')->paginate(20);

select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`
insert into `infos` (`index_title`, `titleInFr`, `titleInEn`, `parent_id`, `updated_at`, `created_at`) values ('bon', 'bon', 'bon', '105', '2018-12-18 01:57:32', '2018-12-18 01:57:32')
---
    public function store(Request $request)
    {
        $this->validate($request, [
            'titleInFr' => 'required' ,
            'titleInEn' => 'required' ,
        ]);

        $info = new Info;
        $info->index_title = $request->input('index_title');
        $info->titleInFr = $request->input('titleInFr');
        $info->titleInEn = $request->input('titleInEn');

        if (null !== $request->input('parent_id'))
        {
            $info->parent_id = $request->input('parent_id');
        }
        else {
            $info->parent_id = 0;
        }
        // dd($info->parent_id);
        if ($request->input('ajoutpar') == 'ajoutparagraph')  {
            // return redirect()->action('InfosController@createparagraph')->with('info',$info);
            $theimages = Imagepage::orderBy('updated_at', 'desc')->paginate(20);
           return view('infos.createparagraph', compact('theimages', 'infoparentid', 'info'));
        }
        if (($request->input('confirmer')) == 'confirmer') {
            $info->save();

select * from `infos` where `infos`.`id` in (1)
select * from `paragraphs`
select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`
---
    public function show($id)
    {
        $info = Info::find($id);
        $paragraphs = Paragraph::with('info')->get();
        $theimages = Imagepage::all();

select * from `imagepages`
select * from `paragraphs` where `paragraphs`.`info_id` = 146 and `paragraphs`.`info_id` is not null
---
    public function edit($id)
    {
        $info = Info::find($id);
        // dd($info);
        $theparagraphs = $info->paragraphs;
        // dd($theparagraphs);
        $theimages = Imagepage::all();
        // $myimages = $paragraphs->imagepages();

        return view('infos.edit')->with('info', $info)->with('theparagraphs',$theparagraphs)->with('theimages', $theimages);

select * from `imagepages`
---
    public function update(Request $request, $id)
    {
       $info = Info::find($id);
        // $paragraphs = $info->children()::all();
        // $paragraphs = $info->paragraphs()::all();
        $theparagraphs = $info->paragraphs;
        // dd($theparagraphs);
        $theimages = Imagepage::all();

select * from `infos` where `infos`.`id` in (101, 102, 103, 105, 106, 107, 108, 109, 110, 111)
---
        // $paragraph->imagepages()->sync($myimages->id, false);
        // return back()->with('success', 'Info créée!');
        //  return view('infos.edit' )->with('info', $info)->with('theparagraphs',$theparagraphs)->with('success', 'Info créée!');
         return redirect()->action('InfosController@edit', $info)->with('success', 'Info 0 créée!');

select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`
---
        */

        // dd($request->input('parent_id'));
        $theimages = Imagepage::orderBy('updated_at', 'desc')->paginate(20);

insert into `paragraphs` (`titleParFr`, `titleParEn`, `textParFr`, `textParEn`, `info_id`, `updated_at`, `created_at`) values ('ez', 'ez', 'ez', 'ez', 139, '2018-12-17 23:02:26', '2018-12-17 23:02:26')
insert into `infos` (`index_title`, `titleInFr`, `titleInEn`, `parent_id`, `updated_at`, `created_at`) values ('ez', 'ez', 'ez', 0, '2018-12-17 23:02:26', '2018-12-17 23:02:26')
---

            $info->save();
            $paragraph->info()->associate($info);
            $paragraph->save();

insert into `infos` (`index_title`, `titleInFr`, `titleInEn`, `parent_id`, `updated_at`, `created_at`) values ('ez', 'ez', 'ez', '0', '2018-12-18 12:34:04', '2018-12-18 12:34:04')
insert into `infos` (`index_title`, `titleInFr`, `titleInEn`, `parent_id`, `updated_at`, `created_at`) values ('ez', 'ez', 'ez', 0, '2018-12-18 00:55:08', '2018-12-18 00:55:08')
insert into `paragraphs` (`titleParFr`, `titleParEn`, `textParFr`, `textParEn`, `info_id`, `updated_at`, `created_at`) values ('ze', 'ze', 'ze', 'ze', 1, '2018-12-27 00:23:39', '2018-12-27 00:23:39')
insert into `paragraphs` (`titleParFr`, `titleParEn`, `textParFr`, `textParEn`, `info_id`, `updated_at`, `created_at`) values ('ez', 'ez', 'ez', 'ez', 156, '2018-12-18 00:55:08', '2018-12-18 00:55:08')
---
            // return redirect()->action('InfosController@edittmp')->with('info', $info)->with('success', 'Paragraphe créé!');
        }
        if ($request->input('action') == 'save')  {
            $info->save();
            $paragraph->info()->associate($info);
            $paragraph->save();
            $theimage = Imagepage::find($request->input('didImg'));
            $theimage->id = $request->input('didImg');

            $paragraph->imagepages()->sync($theimage->id, false);

select count(*) as aggregate from `imagepages`
select * from `imagepages`
select * from `infos` where `infos`.`id` = 195 limit 1
select `imagepages`.*, `imagepage_paragraph`.`paragraph_id` as `pivot_paragraph_id`, `imagepage_paragraph`.`imagepage_id` as `pivot_imagepage_id` from `imagepages` inner join `imagepage_paragraph` on `imagepages`.`id` = `imagepage_paragraph`.`imagepage_id` where `imagepage_paragraph`.`paragraph_id` = 195
---
    public function editparag($id)
    {
        $paragraph = Paragraph::find($id);
        $info = $paragraph->info();
        $theimages = Imagepage::all();
        $myimages = $paragraph->imagepages;
        return view('infos.editparag')->with('paragraph',$paragraph)->with('info', $info)->with('theimages', $theimages)->with('myimages', $myimages);

select * from `imagepages`
---
    public function updateparag(Request $request, $id)
    {
        $paragraph = Paragraph::find($id);
        $info = $paragraph->info;
        $theimages = Imagepage::all();

select * from `infos` where `infos`.`id` in (101, 102, 103, 105, 106, 107, 108, 109, 110, 111, 112)
---


            // return redirect()->action('InfosController@editparag', $paragraph )->withInput()->with('info', $info)->with('success', 'Image ajoutée!');
            return back()->withInput()->with('info', $info)->with('success', 'Image ajoutée!');

select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`
---
    public function manageCategoryinfo($parentid)
    {
        $infoparent = Info::find($parentid);
        $theimages = Imagepage::orderBy('updated_at', 'desc')->paginate(20);

select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`
---
    public function addCategoryinfo(Request $request)
    {

        $this->validate($request, [
            'titleInFr' => 'required' ,
            'titleInEn' => 'required' ,
            'textInFr' => 'required' ,
            'textInEn' => 'required'
        ]);

        $input = $request->all();
        $theimages = Imagepage::all();