app/Http/Controllers/IntrosController.php

select * from `intros` order by `updated_at` desc limit 5 offset 0
select count(*) as aggregate from `intros`
select * from `intros` order by `updated_at` desc limit 20 offset 0
---
    public function index()
    {
        $intros = Intro::orderBy('updated_at', 'desc')->paginate(5);
        return view('intros.index')->with('intros', $intros);

insert into `intros` (`legendFr`, `legendEn`, `urlVideo`, `updated_at`, `created_at`) values ('ccc', 'ccc', 'https://www.youtube.com/embed/tgbNymZ7vqY', '2018-12-05 20:15:22', '2018-12-05 20:15:22')
---
    public function store(Request $request)
    {
       $this->validate($request, [
            'legendFr' => 'required',
            'legendEn' => 'required',
            'urlVideo' => 'required|url',
       ]);

       $intro = new Intro;
       $intro->legendFr = $request->input('legendFr');
       $intro->legendEn = $request->input('legendEn');
       $intro->urlVideo = $request->input('urlVideo');

       $intro->save();