app/Http/Controllers/MusicsController.php

    public function index()
    {
        $musics = Music::orderBy('updated_at', 'desc')->paginate(5);
---
select * from `musics` order by `updated_at` desc limit 5 offset 0
select count(*) as aggregate from `musics`

    public function create()
    {
        $theimages = Imagepage::orderBy('updated_at', 'desc')->paginate(20);
---
select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`

        $music->urlAlbumMusicCdeFr = $request->input('urlAlbumMusicCdeFr');
        $music->urlAlbumMusicCdeEn = $request->input('urlAlbumMusicCdeEn');

        $theimages = Imagepage::orderBy('updated_at', 'desc')->paginate(20);
---
select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`

        }

        if (($request->input('action')) == 'save' && is_null($music->id))  {
            $music->save();
            $theimage->save();
            $music->imagepages()->sync($theimage->id, false);
---
insert into `musics` (`urlVideoMusic`, `legendMFr`, `legendMEn`, `titleMFr`, `titleMEn`, `textMFr`, `textMEn`, `titleAlbum`, `urlAlbumMusicCdeFr`, `urlAlbumMusicCdeEn`, `updated_at`, `created_at`) values ('https://lefigaro.fr', 'ggg', 'ggg', 'ggg', 'ggg', 'ggg', 'ggg', 'ggg', 'https://lefigaro.fr', 'https://lefigaro.fr', '2018-12-10 09:25:12', '2018-12-10 09:25:12')
insert into `imagepages` (`titleIFr`, `titleIEn`, `legendIFr`, `legendIEn`, `cover`, `nameImage`, `updated_at`, `created_at`) values ('jjj', 'jjj', 'jjj', 'jjjj', '1', '1544407036.jpg', '2018-12-10 09:25:12', '2018-12-10 09:25:12')

    public function edit($id)
    {
        $music = Music::find($id);
        $theimages = Imagepage::all();
---
select * from `imagepages`