app/Http/Controllers/VideosController.php

    public function index()
    {
        $videos = Video::orderBy('updated_at', 'desc')->paginate(5);
---
select * from `videos` order by `updated_at` desc limit 5 offset 0
select count(*) as aggregate from `videos`

    public function create()
    {
        $theimages = Imagepage::all();
---
select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`

        $video->urlVideoFr = $request->input('urlVideoFr');
        $video->urlVideoEn = $request->input('urlVideoEn');
        $video->durationVideo = $request->input('durationVideo');
        $theimages = Imagepage::all();
---
select * from `imagepages` order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `imagepages`

    public function show($id)
    {
        $video = Video::find($id);
        $theimages = Imagepage::all();
        $theimage = $video->imagepage;
        return view('videos.show')->with('video', $video)->with('theimage',$theimage)->with('theimages',$theimages);
---
select * from `imagepages`
select * from `imagepages` where `imagepages`.`id` = 24 limit 1

    public function edit($id)
    {
        $video = Video::find($id);
        $theimage = $video->imagepage;
        $theimages = Imagepage::all();
        return view('videos.edit')->with('video', $video)->with('theimages', $theimages)->with('theimage', $theimage);
---
select * from `imagepages` where `imagepages`.`id` = 2 limit 1

    public function update(Request $request, $id)
    {
        $video = Video::find($id);
        if (($request->input('action')) == 'save')  {
            $theimage = Imagepage::find($request->input('didImg'));
---
select * from `imagepages` where `imagepages`.`id` = 18 limit 1